package samsung;

/**
@FILE  : Test3_2.java
@DATE  : 2017. 1. 6.
@AUTHOR: J.John Park
@STORY
		네덜란드의 컴퓨터과학자 에츠허르 다익스트라의 이름에서 유래된 다익스트라 알고리즘은 어떤 변도 음수 가중치를
		갖지 않는 방향이 있는 그래프에서 출발점과 도착점 사이의 최단 경로(최소비용)를 알아내는 알고리즘이다.
		그래프에서, 꼭짓점은 각 도시를 나타내고, 변은 도시 사이를 연결하는 도로의 길이를 나타낸다면, 다익스트라 알고리즘을
		통하여 두 도시 사이의 최단경로(최소비용)를 찾을 수 있다.
		여행을 계획하고 있는 준성이는 각 도시들의 이동거리와 최단경로를 알고 싶어 한다.
		
		1) 문제 제시
			각 도시의 최단 경로를 알려주고 가중치의 합을 구하라(최단거리를 구할 도시 번호를 입력한다).
			
		2) 제약사항
			첨자는 0부터 시작하고, 행렬의 형태는 연결선의 가중치로 하되 연결선이 없을 경우는 -1을 입력한다.
			
		3) 입력
			최단거리를 구할 두 도시의 번호(순서)를 입력한다.
			
		4) 출력
			두 도시 i,j의 연결의 최단거리(가중치가 가장 작은 경로)의 가중치를 출력한다.
 */
public class Test11 {
	public static void main(String[] args) {
		
	}
}
