package samsung2;

/**
@FILE  : Test01.java
@DATE  : 2017. 1. 31.
@AUTHOR: J.John Park
@STORY
		1) 문제
		국방부에서 세 종류의 재래식 폭탄 개발에 성공하였는데, 재래식 폭탄은 상하좌우에만 영향을 미치고
		각 타입마다 영향을 미치는 범위가 다르다. A형 폭탄은 1칸, B형 폭탄은 2칸, C형 폭탄은 3칸에
		영향을 미친다. 예를 들어 해당 위치에 폭탄이 떨어졌을 때 영향을 받는 지역은 색으로 표시되어 있고,
		아무런 영향을 받지 않는 빈칸으로 표시되어 있다. 아무 영향을 받지 않는 지역은 총 61개 지역이다.
		주어진 지도에서 떨어진 폭탄으로 영향을 받지않는 지역은 몇 개인지 구하라.
		
		2) 제약사항
		2차원 배열의 크기 n은 5 <= n <= 50 이며 폭탄의 개수는 30개 이하이다. 폭탄의 타입은 띄어쓰기
		없이 쉼표를 기준으로 나눈다.
		
		3) 입력
		첫째 줄은 테스트케이스 N을 입력한다. (0 < N <= 3)
		둘째 줄은 지도의 크기를 입력하고, 
		셋째 줄은 쉼표(,)를 기준으로 A, B, C형 폭탄의 떨어진 좌표 값을 입력하되 띄어쓰기 없이 작성한다.
		[즉, A가 0 0 1 5 3 5 5 6이고, 이것은 (0,0), (1,5), (3,5), (5,6)을 의미한다.]
		
		4) 출력
		#x형태로 시작하고 공백을 두고 그 다음에 결과를 출력한다. (x는 테스트케이스 번호) 영향을 받지않은 
		칸의 개수를 테스트케이스만큼 정수 형태로 출력한다.
 */
public class Test01 {

}
